# 保存data.json
# import json
# import os

# # 定义数据
# data = {
#     "kitchen": [0, 1, 7, 8, 9, 10, 11, 14, 15, 16, 17, 18, 19, 30, 32, 41, 42, 46, 47, 48, 49, 50, 51, 52, 53, 54, 55, 56, 57, 58, 62, 68, 71, 72, 73, 74, 75, 76, 77, 78, 79, 82, 83, 84, 86, 87, 100, 101, 102, 104, 105, 106, 107, 108, 109, 110, 111, 112, 113, 114, 116, 117, 118, 119, 120, 122, 123, 126, 128, 129, 130, 131, 132, 133, 134, 135, 136, 137, 138],
#     "livingroom": [2, 3, 4, 5, 12, 13, 21, 22, 23, 24, 25, 26, 27, 28, 29, 31, 33, 35, 36, 37, 38, 39, 40, 43, 44, 45, 59, 60, 61, 65, 66, 67, 69, 70, 80, 85, 88, 89, 90, 91, 92, 93, 94, 95, 96, 97, 98, 99, 103, 115, 121, 124, 125],
#     "bathroom": [6, 20, 34, 63, 64, 81],
#     "playVR": [139, 140],
#     "train_list": [34, 81, 20, 6, 70, 96, 24, 37, 28, 33, 44, 99, 2, 124, 65, 12, 90, 91, 125, 67, 66, 115, 40, 88, 23, 22, 35, 25, 5, 13, 94, 27, 59, 103, 69, 93, 85, 61, 29, 140, 107, 123, 11, 122, 114, 55, 48, 17, 138, 120, 108, 82, 79, 104, 16, 41, 129, 116, 135, 42, 100, 131, 9, 46, 71, 106, 72, 76, 0, 136, 47, 134, 58, 133, 132, 73, 84, 87, 126, 51, 119, 52, 118, 130, 128, 30, 83, 7, 54, 18, 49, 112],
#     "test_list": [64, 63, 80, 98, 38, 36, 31, 39, 45, 89, 3, 43, 60, 97, 92, 26, 121, 4, 95, 21, 139, 50, 68, 117, 10, 102, 78, 15, 1, 53, 14, 32, 113, 56, 77, 74, 101, 19, 109, 57, 75, 111, 105, 62, 8, 86, 137, 110]
# }

# # 确保目录存在
# os.makedirs('./dataset', exist_ok=True)

# # 保存文件到 ./dataset/data.json
# with open('./dataset/data.json', 'w') as f:
#     json.dump(data, f, indent=4)

# print("Data saved successfully to './dataset/data.json'")






# 分离原始数据集的数据和label并保存为npz 
import os
import pandas as pd
import numpy as np

# 创建保存数据的文件夹
os.makedirs('session', exist_ok=True)
os.makedirs('label', exist_ok=True)

# 遍历所有CSV文件
for i in range(141):
    # 构造文件名
    filename = f'session{i}.csv'
    
    # 读取CSV文件
    df = pd.read_csv(filename)
    
    # 分离数据和标签
    data = df[['acc_x', 'acc_y', 'acc_z', 'gyro_x', 'gyro_y', 'gyro_z']].values
    labels = df['label'].values
    
    # 保存数据到 .npz 文件
    np.savez(f'session/session{i}.npz', data=data)
    np.savez(f'label/label{i}.npz', label=labels)

print("数据分离并保存完毕。")

